In [1]:
import pandas as pd
import numpy as np
from tqdm import tqdm

In [2]:
file_path = r'../../biobank/ukb672220.csv'
column_to_read = ['eid', '34-0.0']

chunksize = 1000
filtered_chunks = []
print("Starting")

for chunk in tqdm(pd.read_csv(file_path, 
                              chunksize=chunksize, 
                              usecols=column_to_read, 
                              low_memory=False),
                  desc='Processing', 
                  unit=' chunk'):
    filtered_chunks.append(chunk)
    del chunk
    
filtered_df = pd.concat(filtered_chunks, ignore_index=True)

del filtered_chunks    

filtered_df

Starting

Processing: 503 chunk [06:50,  1.23 chunk/s]

            eid  34-0.0
0       1000013  1946.0
1       1000024  1948.0
2       1000036  1960.0
3       1000048  1939.0
4       1000055  1945.0
...         ...     ...
502365  6024050  1948.0
502366  6024062  1944.0
502367  6024077  1961.0
502368  6024085  1947.0
502369  6024096  1939.0

[502370 rows x 2 columns]

In [3]:
filtered_df = filtered_df.drop('34-0.0', axis=1)
filtered_df

            eid
0       1000013
1       1000024
2       1000036
3       1000048
4       1000055
...         ...
502365  6024050
502366  6024062
502367  6024077
502368  6024085
502369  6024096

[502370 rows x 1 columns]

In [4]:
shuffle_df = filtered_df.sample(frac=1, random_state=2)

In [5]:
output_csv = r'Control Group EIDs Output.csv'
sample_df = shuffle_df.sample(n=40000, random_state=42, ignore_index=True)
sample_df.to_csv(output_csv, index=False)

sample_df

           eid
0      6020371
1      1931802
2      3999073
3      2455864
4      5848348
...        ...
39995  3631967
39996  2317629
39997  4772904
39998  2110445
39999  2099643

[40000 rows x 1 columns]